In [1]:
# Pandas is an open source python library built on top of the numpy specifically designed for working with structured data

In [8]:
import pandas as pd
import csv

#### Data frames are 2D like a table. They have labelled axes - columns and rows

##### Primary data structures in Pandas:
1-D single column with labeled index, Homogeneous, used for single columns of data

2-D Multiple columns, Heterogeneous data, used for tabular data

### Data Manipulation
Filtering
Aggregation
Reshaping
### Data I/O  
csv
Xls
databases
### Handling Missing data
isna()
dropna()
fillna()
### Time Series analysis
To_datetime()

In [6]:
dt = pd.read_csv('data.csv')
dt

           Name   Age          City
0      John Doe    28      New York
1    Jane Smith    34   Los Angeles
2  Mike Johnson    45       Chicago
3   Emily Davis    22       Houston

In [14]:
import csv

# Define the student data
students = [
    {'Roll No': 1, 'Name': 'John Doe', 'Class': '10th', 'Marks': 85},
    {'Roll No': 2, 'Name': 'Jane Smith', 'Class': None, 'Marks': 90},
    {'Roll No': 3, 'Name': 'Sam Brown', 'Class': '10th', 'Marks': 78}
]

# Specify the filename
file = 'student_data.csv'

# Writing to csv file
with open(file, 'w', newline='') as csvfile:
    # Create a writer object
    fieldnames = ['Roll No', 'Name', 'Class', 'Marks']
    writer = csv.DictWriter(csvfile, fieldnames=fieldnames)
    
    # Write the header (fieldnames)
    writer.writeheader()
    
    # Write the student data
    for student in students:import csv

# Define the student data
students = [
    {'Roll No': 1, 'Name': 'John Doe', 'Class': '10th', 'Marks': 85},
    {'Roll No': 2, 'Name': 'Jane Smith', 'Class': None, 'Marks': 90},
    {'Roll No': 3, 'Name': 'Sam Brown', 'Class': '10th', 'Marks': 78}
]

# Specify the filename
file = 'student_data.csv'

# Writing to csv file
with open(file, 'w', newline='') as csvfile:
    # Create a writer object
    fieldnames = ['Roll No', 'Name', 'Class', 'Marks']
    writer = csv.DictWriter(csvfile, fieldnames=fieldnames)
    
    # Write the header (fieldnames)
    writer.writeheader()
    
    # Write the student data
    for student in students:
        writer.writerow(student)

print(f"Data has been written to {filename}")

        writer.writerow(student)

print(f"Data has been written to {filename}")

Data has been written to student_data.csv

In [19]:
ff = pd.read_csv('student_data.csv')
ff

   Roll No        Name Class  Marks
0        1    John Doe  10th     85
1        2  Jane Smith   NaN     90
2        3   Sam Brown  10th     78

In [20]:
d = pd.DataFrame(ff)

In [21]:
d

   Roll No        Name Class  Marks
0        1    John Doe  10th     85
1        2  Jane Smith   NaN     90
2        3   Sam Brown  10th     78

In [22]:
d.count()

Roll No    3
Name       3
Class      2
Marks      3
dtype: int64

In [24]:
d['Marks'].mean()

84.33333333333333

In [25]:
d['Marks'].std()

6.027713773341707

In [26]:
d['Marks'].max()

90

In [27]:
d['Marks'].min()

78

In [29]:
d['Class'].isna()

0    False
1     True
2    False
Name: Class, dtype: bool

## Quartile: 
#### Quartiles are values that split a ranked dataset into four equal parts

In [30]:
import pandas as pd
data = [[1, 1, 2], [6, 4, 2], [4, 2, 1], [4, 2, 3]]
df = pd.DataFrame(data)
print(df.quantile(0.2))

0    2.8
1    1.6
2    1.6
Name: 0.2, dtype: float64

## Outlier calc: 
identify outliers by defining boundaries based on 25th percentile (Q1) and the 75th percentile (Q3)
IQR
Define the lower and upper bounds

Any data point outside these bounds is considered an outlie.

In [40]:
if student['Class'] is None:
    student['Class'] = 0
    
for student in students:
    print(student)

{'Roll No': 1, 'Name': 'John Doe', 'Class': '10th', 'Marks': 85}
{'Roll No': 2, 'Name': 'Jane Smith', 'Class': None, 'Marks': 90}
{'Roll No': 3, 'Name': 'Sam Brown', 'Class': '10th', 'Marks': 78}

In [42]:
df = pd.DataFrame(students)
df

   Roll No        Name Class  Marks
0        1    John Doe  10th     85
1        2  Jane Smith  None     90
2        3   Sam Brown  10th     78

## replace Nan

In [48]:
d = df['Class'].fillna(0, inplace=True)
df

   Roll No        Name Class  Marks
0        1    John Doe  10th     85
1        2  Jane Smith     0     90
2        3   Sam Brown  10th     78

# Quantile
Calculate the Quartiles:

Q1 (First Quartile): The 25th percentile of the data.

Q3 (Third Quartile): The 75th percentile of the data.
Compute the IQR:

IQR = ùëÑ3 ‚àí ùëÑ1

In [50]:
Q1 = df['Marks'].quantile(0.25)
Q3 = df['Marks'].quantile(0.75)

IQR = Q3 - Q1
IQR

6.0

In [51]:
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

In [53]:
outliers = df[(df['Marks'] < lower_bound) | (df['Marks']>upper_bound)]

In [54]:
print("Lower Bound:", lower_bound)
print("Upper Bound:", upper_bound)
print("Outliers:")
print(outliers)

Lower Bound: 72.5
Upper Bound: 96.5
Outliers:
Empty DataFrame
Columns: [Roll No, Name, Class, Marks]
Index: []